Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: DllFile may be omitted when calling a function that resides in User32.dll, Kernel32.dll, ComCtl32.dll, or Gdi32.dll.
ja: User32.dll、Kernel32.dll、ComCtl32.dll、Gdi32.dllに存在する関数を呼び出す場合、DllFileを省略することができます。

source: ExcludeTitle and ExcludeText can be used to exclude one or more windows by their title or text.
ja: ExcludeTitleとExcludeTextはウィンドウのタイトルまたはテキストで除外するために使用します。

source: Expression can access other instance variables and methods via this.
ja: Expressionは thisを介して他のインスタンス変数やメソッドにアクセスできる。

source: Expression has the same interpretation as for instance variables, except that this refers to the class itself.
ja: 式は、thisがクラス自身を参照することを除いて、インスタンス変数と同じ解釈をする。

source: Expressions are combinations of one or more values, variables, operators and function calls.
ja: 式は、1つ以上の値、変数、演算子、関数呼び出しの組み合わせです。

source: FilePattern is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: FilePatternは、絶対パスが指定されない場合、A_WorkingDirにあるとみなされます。

source: FileSize and NewSize is the size of the file, in bytes.
ja: FileSizeと NewSizeは、ファイルのサイズをバイト単位で表します。

source: Finally statements are not executed if the script is directly terminated by any means, including the tray menu or ExitApp.
ja: トレイメニューやExitAppなど、何らかの手段でスクリプトを直接終了させた場合は、Finally文は実行されません。

source: FontName may be the name of any font, such as one from the font table.
ja: FontNameには、フォントテーブルのような任意のフォントの名前を指定することができる。

source: Force-local mode has been removed.
ja: 強制ローカルモードは削除されました。

source: Format is an optional format specifier, as described below.
ja: Formatは、後述するオプションのフォーマット指定子です。

source: Function has a MinParams property which exceeds the number of parameters that the callback will supply.
ja: 関数には MinParamsプロパティがあり、コールバックが供給するパラメータの数を超えています。

source: Function is called on the current thread, before it exits (that is, before the call stack unwinds).
ja: 関数は、現在のスレッドが終了する前に（つまり、コールスタックが巻き戻される前に）、呼び出されます。

source: Function is called only for errors or exceptions which would normally cause an error message to be displayed.
ja: 通常であればエラーメッセージが表示されるようなエラーや例外が発生した場合にのみ、関数が呼び出されます。

source: Function is not an object, or has neither a MinParams property nor a Call method.
ja: Functionがオブジェクトでない、またはMinParamsプロパティもCallメソッドも持っていない。

source: Functions take a varying number of inputs, perform some action or calculation, and then return a result.
ja: 関数は、さまざまな入力を受け取り、何らかのアクションや計算を行い、その後 返り値を返す。

source: Goto, Break, Continue and Return cannot be used to exit a Finally block, as that would require suppressing any control flow statements within the Try block.
ja: Tryブロック中の制御フローステートメントを抑制するため、Goto、Break、ContinueまたはReturnでは、Finallyブロックを抜け出すことはできません。

source: Goto, break, continue and return cannot be used to exit a finally block, as that would require suppressing any control flow instructions within the try block.
ja: Goto、break、continue、returnは、tryブロック内の制御フロー命令を抑制する必要があるため、finallyブロックを終了するために使用することはできない。

source: IconNumber should be the mask/transparency color number (0xFFFFFF [the color white] might be best for most pictures); and ResizeNonIcon should be non-zero to cause the picture to be scaled to become a single icon, or zero to divide up the image into however many icons can fit into its actual width.
ja: IconNumberには、マスク/透明度の色番号（0xFFFFFF [白]がほとんどの画像に最適かもしれません）を指定し、ResizeNonIconには、画像を1つのアイコンになるように拡大縮小する場合は0以外、画像を実際の幅に収まる数のアイコンに分割する場合は0を指定します。

source: If Var is [not] Type identified certain (possibly locale-specific) non-ASCII characters as alphabetic/uppercase/lowercase by default in v1.0, whereas it did so in v1.1 only if StringCaseSense Locale was used.
ja: If Var is [not] Typeはv1では特定の（おそらくロケール固有の）非 ASCII 文字をデフォルトでアルファベット/アッパーケース/小文字として識別しましたが、 v1.1 では StringCaseSense Locale が使われている場合にのみそうしていました。

source: If Var is [not] Type ignores the system locale by default
ja: If Var is [not] Typeはデフォルトでシステムロケールを無視する

source: Index corresponds to the position of the method within the original interface definition.
ja: インデックスは、元のインターフェース定義内でのメソッドの位置に対応します。

source: Index is an integer indicating which input value to use, where 1 is the first value.
ja: Indexは、どの入力値を使用するかを示す整数で、1が最初の値です。

source: InputBoxObj is an object with the properties Result (containing "OK", "Cancel" or "Timeout") and Value.
ja: InputBoxObjは、Result（"OK"、"Cancel"、"Timeout"を含む）およびValueのプロパティを持つオブジェクトです。

source: IsFocused is 1 (true) if the control has the keyboard focus, otherwise 0 (false).
ja: IsFocusedは、キーボードフォーカスがあれば1 (true)を、そうでないときは0 (false)を返します。

source: Key must be omitted.
ja: キーは省略する必要があります。

source: KeyName can also be the name of an existing hotkey (created with the double-colon syntax), which will cause that hotkey to be updated with the values of the function's other parameters.
ja: KeyNameには、既存のホットキー（ダブルコロン構文で作成）の名前を指定することもでき、そのホットキーは、関数の他のパラメータの値で更新されます。

source: KeyName can be omitted only if a registry loop is running, in which case it defaults to the key of the current loop item (even if the key has been deleted during the loop).
ja: KeyNameは レジストリループが実行されている場合にのみ省略可能で、その場合は現在のループアイテムのキーがデフォルトとなります（ループ中にキーが削除された場合も同様）。

source: KeyName can be omitted only if a registry loop is running, in which case it defaults to the key of the current loop item.
ja: KeyNameは レジストリループが実行されている場合のみ省略可能で、その場合、現在のループアイテムのキーがデフォルトとなります。

source: Label can be a variable or expression only if parentheses are used.
ja: ラベルは、括弧を使用する場合のみ、変数または式にすることができます。

source: Level should be an integer between 0 and 101.
ja: Levelは 0～101 の整数を指定します。

source: LoopLabel identifies which loop this statement should apply to; either by label name or numeric nesting level.
ja: LoopLabelは、このステートメントがどのループに適用されるかを指定します。ラベル名または数値の入れ子レベルによって指定します。

source: LoopLabel must be a constant value - variables and expressions are not supported, with the exception of a single literal number or quoted string enclosed in parentheses.
ja: LoopLabelは定数値でなければならず、変数や式はサポートされていません。ただし、括弧で囲まれた単一のリテラル数値または引用文字列は例外です。

source: Menu can be "0&" to select an item within the window's system menu, which typically appears when the user presses Alt+Space or clicks on the icon in the window's title bar.
ja: Menuは、 Alt+Spaceを押すか、ウィンドウのタイトルバーのアイコンをクリックすると表示されるウィンドウのシステムメニューの中の項目を選択するために"0&"を使用することができます。

source: Menu can be 0& to select an item within the window's system menu, which typically appears when the user presses Alt+Space or clicks on the icon in the window's title bar.
ja: メニューは、 Alt+Spaceを押すか、ウィンドウのタイトルバーのアイコンをクリックすると表示されるウィンドウのシステムメニューの中の項目を選択するために0&を使用することができます。

source: Message and Extra are converted to strings.
ja: Messageと Extraは文字列に変換されます。

source: Mode affects the order of activation across the entire group.
ja: モードは、グループ全体の起動順序に影響します。

source: Mode is valid only for IsAlpha, IsAlnum, IsUpper and IsLower.
ja: Modeは、IsAlpha、IsAlnum、IsUpper、IsLowerに対してのみ有効です。

source: N may be negative and may contain a decimal point.
ja: Nは負の値でもよく、小数点を含むことができる。

source: Needle is an empty (zero-length) string.
ja: Needleは、空（長さゼロ）の文字列です。

source: NewBaseObj must be an Object.
ja: NewBaseObjは Object でなければなりません。

source: NewColor is one of the 16 primary HTML color names, a hexadecimal RGB color value (the 0x prefix is optional), a pure numeric RGB color value, or the word Default (or an empty string) for its default color.
ja: NewColorは、16の主要なHTMLカラー名、16進数のRGBカラー値（接頭辞0xはオプション）、純粋な数値のRGBカラー値、またはデフォルトカラーを表すDefault（または空の文字列）のいずれかです。

source: NewEncoding may be a numeric code page identifier (see Microsoft Docs) or one of the following strings.
ja: NewEncodingには、数値のコードページ識別子（Microsoft Docsを参照）または以下の文字列のいずれかを指定します。

source: NewText should be the full text (case insensitive) of the item/tab to select.
ja: NewTextには、選択する項目/タブの全文（大文字・小文字を区別しない）を指定します。

source: NewText should be the full text (case-insensitive) of the item/tab to select.
ja: NewTextには、選択する項目/タブの全文（大文字・小文字を区別しない）を指定します。

source: NewValue can be 0 to uncheck the button, 1 to check it, or -1 to give it a gray checkmark.
ja: NewValueは、ボタンのチェックを外す場合は0、チェックする場合は1、グレーのチェックマークを付ける場合は-1です。

source: NewValue can be a set of modifiers with a key name, or blank to clear the control.
ja: NewValueには、キー名を持つ修飾語のセット、またはコントロールをクリアするためのブランクを指定することができます。

source: NewValue is a date-time stamp in YYYYMMDDHH24MISS format.
ja: NewValueは、YYYYMMDDHH24MISS形式の日付-時間スタンプです。

source: NewValue is the control's new text.
ja: NewValueは、コントロールの新しいテキストです。

source: NewValue is the filename (or handle) of the new image to load (see Picture for supported file types).
ja: NewValueは、読み込む新しい画像のファイル名（またはハンドル）です（サポートされているファイルタイプはPictureを参照してください）。

source: NewValue is the new content.
ja: NewValueは新しいコンテンツです。

source: NewValue is the new position of the control, for example MySlider.Value := 10.
ja: NewValueはコントロールの新しい位置で、例えばMySlider.Value := 10のようになります。

source: NewValue is the number of pixels of space to leave at the left and right side of the window when auto-positioning any control that lacks an explicit X coordinate.
ja: NewValueは、X座標が明示されていないコントロールを自動配置する際に、ウィンドウの左右に残すスペースのピクセル数です。

source: NewValue is the number of pixels of space to leave at the top and bottom side of the window when auto-positioning any control that lacks an explicit Y coordinate.
ja: NewValueは、Y座標が明示されていないコントロールを自動配置する際に、ウィンドウの上側と下側に残すスペースのピクセル数です。

source: NewValue is the position of a single item/tab to select, or zero to clear the current selection (this is valid even for Tab controls).
ja: NewValueは、選択する1つのアイテム/タブの位置、または現在の選択をクリアするためのゼロです（これはタブコントロールでも有効です）。

source: NewValue should be 1 (true) to enable mouse click detection and resetting of the hotstring recognizer, or 0 (false) to disable it.
ja: NewValueは、マウスクリックの検出とホットストリング認識器のリセットを有効にする場合は 1 (true)、無効にする場合は 0 (false)を指定します。

source: NumType is either UInt, Int, Int64, Short, UShort, Char, UChar, Double, or Float.
ja: NumTypeは、UInt、Int、Int64、Short、UShort、Char、UChar、Double、Float のいずれかです。

source: Number must be expressed in radians.
ja: 数値はラジアン単位で表現する必要があります。

source: NumberOfVars contains the number of variables passed to the for-loop.
ja: NumberOfVarsには、forループに渡される変数の数が入る。

source: Obj is an object with the properties result (containing "OK", "Cancel" or "Timeout") and value.
ja: Objは、result（"OK"、"Cancel"、"Timeout"を含む）およびvalueのプロパティを持つオブジェクトです。

source: Occurrence or StartingPos is 0 or non-numeric.
ja: OccurrenceまたはStartingPosが0または非数値である。

source: Operators take the form of a symbol or group of symbols such as + or :=, or one of the words and, or, not, is, in or contains.
ja: 演算子は、+や :=などの記号や記号群、またはand、or、not、is、in、containsのいずれかの単語の形をとる。

source: Options can often be used to run a program minimized or hidden, instead of having it pop up on screen, but some programs ignore it.
ja: オプションは、プログラムを画面にポップアップさせるのではなく、最小化または非表示にして実行するために使用できることが多いですが、プログラムによっては無視されることもあります。

source: Options is interpreted the same, but the default settings differ:
ja: Optionsの解釈は同じですが、初期設定が異なります：

source: OutFile can be * to write the output to stdout.
ja: OutFileは *標準出力に出力を書き出す。

source: OutputVarPID gives you the process ID, which is often used with WinWait or WinWaitActive and ahk_pid to wait until the program shows a window on screen, or to identify one of its windows.
ja: OutputVarPIDはプロセスIDを与えるもので、WinWaitや WinWaitActive、ahk_pidとともに、プログラムが画面にウィンドウを表示するまで待つ、あるいはそのウィンドウの一つを特定するためによく使われます。

source: ParamCount is negative.
ja: ParamCountは否定的です。

source: ParamCount is omitted and:
ja: ParamCountは省略され、更に

source: ParamCount is omitted and: 1) Function has no MinParams property; or 2) the & option is used with the standard 32-bit calling convention.
ja: ParamCountは省略され、更に1)Functionに MinParamsプロパティがない、または2)&オプションが標準32ビット呼び出し規約で使用されている。

source: Path does not exist or is a network drive that is presently inaccessible, etc.
ja: Pathが存在しない、または現在アクセスできないネットワークドライブである、など。

source: Percent signs within an expression are used to create dynamic variable references, but these are rarely needed.
ja: 式中のパーセント記号は、動的な変数参照を作成するために使用されますが、これらはほとんど必要ありません。

source: Property is simply the name of the property, which will be used to invoke it.
ja: Propertyは単にプロパティの名前であり、このプロパティを呼び出すために使用される。

source: RequestedCapacity is less than -1 or greater than can theoretically be supported by the current platform.
ja: RequestedCapacityが-1より小さいか、現在のプラットフォームが理論的にサポートできる容量より大きい。

source: RetrievedColor is a 6-digit RGB value of the current color previously set by this property, or an empty string if the default color is being used.
ja: RetrievedColorは、このプロパティで以前に設定された現在の色の 6 桁の RGB 値であり、デフォルトの色が使用されている場合は空文字列です。

source: RetrievedEncoding is never a value with the -RAW suffix, regardless of how the file was opened or whether it contains a byte order mark (BOM).
ja: RetrievedEncodingは、ファイルの開き方やバイトオーダーマーク（BOM）の有無にかかわらず、接尾辞-RAWを持つ値ではありません。

source: RetrievedEncoding is one of the following strings:
ja: RetrievedEncodingは、以下の文字列のいずれかである：

source: RetrievedText has a maximum length of 8191.
ja: RetrievedTextの長さは最大8191です。

source: RetrievedValue is 1 if the Checkbox or Radio control is checked, 0 if it is unchecked, or -1 if it has a gray checkmark.
ja: RetrievedValueは、CheckboxまたはRadioコントロールがチェックされている場合は 1、チェックされていない場合は 0、灰色のチェックマークがある場合は -1 となります。

source: RetrievedValue is a date-time stamp in YYYYMMDDHH24MISS format currently selected in the DateTime or MonthCal control.
ja: RetrievedValueは、DateTimeまたはMonthCalコントロールで現在選択されているYYYYMMDDH24MISS形式の日付-時間スタンプです。

source: RetrievedValue is the ActiveX object of the ActiveX control.
ja: RetrievedValueは、ActiveXコントロールの ActiveX オブジェクトです。

source: RetrievedValue is the current content of the Edit control.
ja: RetrievedValueは、Editコントロールの現在の内容です。

source: RetrievedValue is the current position of the UpDown, Slider or Progress control.
ja: RetrievedValueは、UpDown、Slider、Progressコントロールの現在の位置です。

source: RetrievedValue is the modifiers and key name if there is a hotkey in the Hotkey control; otherwise blank.
ja: RetrievedValueは、Hotkeyコントロールにホットキーがある場合は修飾子およびキー名、それ以外は空白とします。

source: RetrievedValue is the number of pixels of the current horizontal margin.
ja: RetrievedValueは、現在の水平マージンのピクセル数です。

source: RetrievedValue is the number of pixels of the current vertical margin.
ja: RetrievedValueは、現在の垂直マージンのピクセル数です。

source: RetrievedValue is the picture's file name as it was originally specified when the Picture control was created.
ja: RetrievedValueは、Pictureコントロールの作成時に指定された画像のファイル名です。

source: RetrievedValue is the position of the currently selected item/tab in the Tab, DropDownList, ComboBox or ListBox control.
ja: RetrievedValueは、Tab、DropDownList、ComboBox、ListBoxコントロールにおいて、現在選択されている項目/タブの位置です。

source: RetrievedValue is the text/caption of the Text control.
ja: RetrievedValueは、Textコントロールのテキスト/キャプションです。

source: ReturnType: If the function returns a 32-bit signed integer (Int), BOOL, or nothing at all, ReturnType may be omitted.
ja: ReturnType：関数が32ビット符号付き整数（Int）、BOOL、または何も返さない場合は、ReturnTypeを省略することができる。

source: Run all scripts with a specific interpreter disables the launcher and allows the user to select which exe to use to run all scripts, the traditional way.
ja: すべてのスクリプトを特定のインタープリターで実行する ランチャーを無効にし、従来の方法で、すべてのスクリプトを実行するために使用するexeを選択できるようにします。

source: Semantic note: Technically, some Unicode characters are represented by two 16-bit code units, collectively known as a "surrogate pair." Similarly, some ANSI code pages (commonly known as Double Byte Character Sets) contain some double-byte characters.
ja: 意味：技術的には、一部のUnicode文字は2つの16ビットコードユニットで表され、集合的に「サロゲートペア」として知られています。同様に、いくつかのANSIコードページ（一般にダブルバイト文字セットとして知られている）には、いくつかのダブルバイト文字が含まれています。

source: SetFormat itself was removed in v2.0.
ja: SetFormat自体はv2.0で削除されました。

source: SourcePattern is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: SourcePatternは、絶対パスが指定されない場合、A_WorkingDirにあるとみなされます。

source: Speed is ignored for SendInput/Play modes; they move the mouse instantaneously (though SetMouseDelay has a mode that applies to SendPlay).
ja: SendInput/PlayモードではSpeedは無視され、マウスは瞬時に移動します（ただし、SetMouseDelayにはSendPlayに適用されるモードがあります）。

source: Speed is ignored for the modes SendInput and SendPlay; they move the mouse instantaneously (though SetMouseDelay has a mode that applies to SendPlay).
ja: Speedの設定は、SendInput関数とSendPlay関数では無視され、マウスは瞬時に移動します。（ただし、SetMouseDelay関数には、SendPlayに適用されるモードがあります。）

source: String is assumed to be in the native encoding.
ja: 文字列は ネイティブ・エンコーディングであると仮定される。

source: String may be matched to an existing hotstring by considering case-sensitivity (C), word-sensitivity (?), activation criteria (as set by #HotIf or HotIf) and the trigger string.
ja: 文字列は、大文字小文字の区別（C）、単語の区別（?）、活性化基準（#HotIfまたはHotIfで設定）、トリガー文字列を考慮して、既存のホットストリングと一致させることができます。

source: Super-global variables have been removed (excluding built-in variables, which aren't quite the same as they cannot be redeclared or shadowed).
ja: スーパーグローバル変数が廃止されました（組み込み変数を除く、再宣言やシャドウができないので同じではありません）。

source: Switches can be a mixture of any of the standard switches and the following launcher-only switches:
ja: スイッチには、標準的なスイッチと以下のランチャー専用スイッチを混在させることができる：

source: Target might not need to include a path if the target file resides in one of the folders listed in the system's PATH environment variable.
ja: ターゲットファイルがシステムのPATH環境変数にリストされたフォルダのいずれかに存在する場合、ターゲットにパスを含める必要がない場合があります。

source: TargetVar is not a valid variable reference.
ja: TargetVarは有効な変数参照ではありません。

source: TimeUnits may be one of the following strings (or just the first letter):
ja: TimeUnitsは、以下の文字列のいずれか（または最初の文字のみ）を指定します：

source: TimeUnits may be one of the following strings (or just the first letter): Seconds, Minutes, Hours or Days.
ja: TimeUnitsは、以下の文字列のいずれか（または最初の文字のみ）を指定します：Seconds、Minutes、Hours または Days。

source: Transform HTML supports additional features in Unicode versions of AutoHotkey_L.
ja: Transform HTMLはAutoHotkey_LのUnicodeバージョンで追加機能をサポートしています。

source: Transform Unicode is available only in ANSI versions of AutoHotkey.
ja: Transform UnicodeはAutoHotkeyのANSIバージョンでのみ利用可能です。

source: Try statements behave differently depending on whether Catch or Finally is present.
ja: Try文は、Catchや Finallyがあるかどうかで動作が異なります。

source: Try statements behave differently depending on whether catch or finally is present.
ja: Try文は、catchや finallyがあるかどうかで動作が異なります。

source: Unary operators are written either before or after a single operand, depending on the operator.
ja: 単項演算子は、演算子によって、1つのオペランドの前か後に書かれます。

source: Unsigned 64-bit integers are not supported, as AutoHotkey's native integer type is Int64.
ja: AutoHotkeyのネイティブ整数型はInt64なので、符号なし64ビット整数はサポートされていません。

source: Unsigned 64-bit integers produced by a function are not supported.
ja: 関数で生成される符号なし64ビット整数はサポートされていません。

source: User's domain.
ja: ユーザーのドメイン。

source: User's password.
ja: ユーザーのパスワードです。

source: Value must be a string, otherwise a TypeError is thrown.
ja: Valueは文字列でなければならず、そうでない場合はTypeErrorが投げられる。

source: Value must have an even number of digits between 4 and 14 (inclusive) to be considered valid.
ja: 値は、4～14（含）の偶数桁でなければ有効とはみなされない。

source: Values are numbers, objects or strings.
ja: 値は、数値、オブジェクト、文字列です。

source: Variables can be used in an expression simply by writing the variable's name.
ja: 変数は、変数名を書くだけで式の中で使用することができます。

source: What indicates the source of the error.
ja: What エラーの原因を示します。

source: WinTitle and WinText have the same meaning as for WinActive or WinExist, but only strings can be used, and they are evaluated according to the default settings for SetTitleMatchMode and DetectHiddenWindows as set by the auto-execute thread.
ja: WinTitle、WinTextは、WinActive、WinExistと同じ意味ですが、文字列のみ使用でき、自動実行スレッドが設定したSetTitleMatchMode、DetectHiddenWindowsのデフォルト設定に従って評価されます。

source: WorkingDir specifies the working directory for the new process.
ja: WorkingDirは、新しいプロセスの作業ディレクトリを指定します。

source: ; Attach the ImageLists to the ListView so that it can later display the icons:
ja: ; ListViewにImageListを貼り付けて、後でアイコンを表示できるようにする：

source: ; If the above loop had zero iterations because there were no ending characters found,
ja: ; もし、上記のループが、終了文字が見つからなかったために、繰り返し回数が0回だった場合、

source: DownTemp and DownR have the same effect as Down except for the modifier keys (Control, Shift, Alt, and Win).
ja: DownTempと DownRは、修飾キー（Control、Shift、Alt、Win）以外はDownと同じ効果になります。

source: Finally can also be present, but must be placed after Else, and is always executed last.
ja: Finallyも存在できるが、Elseの後に置かなければならず、常に最後に実行される。

source: ; See if there are any other URLs in this line:
ja: ; この行の中に他のURLがあるかどうかを確認する：

source: ; Apply control events:
ja: ; コントロールイベントを適用する：

source: ; Recursive call to self:
ja: ; selfを再帰的に呼び出す：

source: ; Otherwise, move the input box's insertion point to where the user will type the abbreviation.
ja: ; そうでない場合は、入力ボックスの挿入点をユーザーが略語を入力する場所に移動させます。

source: ; Apply window events:
ja: ; ウィンドウイベントを適用する：

source: ; Create a popup menu to be used as the context menu:
ja: ; コンテキストメニューとして使用するポップアップメニューを作成します：

source: ; Display the window:
ja: ; ウィンドウを表示する：

source: ; Create a UTF-16 file without byte order mark.
ja: ; バイトオーダーマークのない UTF-16 ファイルを作成します。

source: ; Create the ListView with two columns, Name and Size:
ja: ; NameとSizeの2つのカラムを持つListViewを作成します：

source: ; Get the text currently selected. The clipboard is used instead of
ja: ; 現在選択されているテキストを取得します。その代わりにクリップボードが使われます。

source: ; Initialize counter to keep track of our position in the string.
ja: ; 文字列中の位置を記録するためのカウンターを初期化します。

source: ; Intercept Tab only while we're showing a tooltip.
ja: ; ツールチップを表示している間だけ、インターセプトタブを表示します。

source: ; It's done this particular way because some URLs have other URLs embedded inside them:
ja: ; URLの中には、他のURLが埋め込まれているものがあるため、このような特殊な方法になっています：

source: ; Load each picture and add it to the array.
ja: ; 各画像を読み込み、配列に追加する。

source: ; New
ja: ; 新しい

source: ; Otherwise, try to launch it:
ja: ; それ以外の場合は、起動してみてください：

source: ; Retrieve the ID of the last item.
ja: ; 最後のアイテムのIDを取得します。

source: ; Run the "My Documents" folder using a built-in variable:
ja: ; マイドキュメントフォルダを組み込み変数を使って開きます：

source: ; Set our callback function.
ja: ; コールバック関数を設定します。

source: ; These are function calls with parentheses:
ja: ; 以下は括弧ありで関数を呼び出しています：

source: Case and Default must be terminated with a colon.
ja: CaseとDefaultはコロンで終了しなければならない。

source: CaseSense can be "Locale".
ja: CaseSenseは「Locale」にすることができます。

source: Char is a string containing the character or characters.
ja: Charは、文字または文字を含む文字列です。

source: ClickCount is the number of notches to turn the wheel.
ja: ClickCountは、ホイールを回すノッチの数です。

source: Dest is the actual path and name that the directory will have after it is moved; it is not the directory into which Source is moved (except for the known limitation mentioned below).
ja: Destは、移動後のディレクトリが持つ実際のパスと名前であり、Sourceが移動するディレクトリではありません（後述の既知の制限を除きます）。

source: Expression is usually written as a quoted string, but can also be a variable or expression which returns text matching a #HotIf expression.
ja: Expressionは、通常、引用符で囲まれた文字列として記述されますが、#HotIf式にマッチするテキストを返す変数や式にすることもできます。

source: File and Line indicate the current script line at this stack depth.
ja: Fileと Lineは、このスタックの深さにおける現在のスクリプト行を示します。

source: Locale is 1 to 8 times slower than Off depending on the nature of the strings being compared.
ja: Localeは、比較する文字列の性質によって、Offの1～8倍遅くなります。

source: Options is a string of zero or more case-insensitive options delimited by a space or tab.
ja: オプションは、スペースまたはタブで区切られた、0個以上の大文字小文字を区別しないオプションの文字列です。

source: Pairs must not contain any blank lines.
ja: ペアは空白行を含んではならない。

source: Params is an enumerable object (an object with an __Enum method), such as an Array containing parameter values.
ja: Paramsは、パラメータ値を含むArrayのような列挙可能なオブジェクト（__Enumメソッドを持つオブジェクト）です。

source: Precision specifies the maximum number of characters to be printed.
ja: Precisionは、印刷する文字数の最大値を指定します。

source: PressDuration also produces a delay after any change to the modifier key state (Ctrl, Alt, Shift, and Win) needed to support the keys being sent.
ja: PressDurationは、送信されるキーをサポートするために必要な修飾キー状態（Ctrl、Alt、Shift、Win）の変更後にも遅延を発生させることができます。
